In [ ]:
import os
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

##reading data

In [ ]:
#dict of lists
info={
    'names':['suraj','shiv','shivi','Anjali','sunny'],
    'age':[19,5,21,20,22],
    'height' :[5.23,3.5,5.1,5.9,6.1]
}
d1 =pd.DataFrame(info)
d1

In [33]:
d2=pd.read_csv('datasample.csv')
d2

     name  english  math  science
0   arjun       45    67       89
1  jyothi       67    89       90
2     sai       89    90       78
3     sri       90    78       67

In [ ]:
pd.set_option('display.max_columns',None)

In [ ]:
df =pd.read_excel('Canada.xlsx',
              sheet_name=1,
              skiprows=20,
              skipfooter=2
              )
df

## looking at data
- head(n) - top 5 rows of the data
- tail(n) - bottem n rows of the data
- sample(n) - random n samples of the data
- info() - column wise datatype
- describe() - summary statistics of the data

In [ ]:
df.head(2)

In [ ]:
df.tail()

In [ ]:
df.sample(3)

In [ ]:
df.info()

In [ ]:
df.describe()

In [ ]:
df.describe(include='object')

# column wise data

In [ ]:
df.columns

In [ ]:
df['OdName'] # series object

In [ ]:
# multiplecolumns
df[['AreaName','RegName']]#dataframe object

In [ ]:
years = list(range(1980,2014))
df[years]

In [ ]:
df[['OdName',1980,1990,2000,2010]]

In [ ]:
# row wise access using loc and iloc
df.loc[1] # label wise location

In [ ]:
df.iloc[1] #index wise location

In [28]:
df.iloc[:10,[0,1,2,3,4]] # column should be indexes

,Type,Coverage,OdName,AREA,AreaName
0,Immigrants,Foreigners,Afghanistan,935,Asia
1,Immigrants,Foreigners,Albania,908,Europe
2,Immigrants,Foreigners,Algeria,903,Africa
3,Immigrants,Foreigners,American Samoa,909,Oceania
4,Immigrants,Foreigners,Andorra,908,Europe
5,Immigrants,Foreigners,Angola,903,Africa
6,Immigrants,Foreigners,Antigua and Barbuda,904,Latin America and the Caribbean
7,Immigrants,Foreigners,Argentina,904,Latin America and the Caribbean
8,Immigrants,Foreigners,Armenia,935,Asia
9,Immigrants,Foreigners,Australia,909,Oceania

In [29]:
df.loc[:10,['OdName',1980,1990,2000,2010]] # column should be labels

                 OdName  1980  1990  2000  2010
0           Afghanistan    16  1028  3326  1758
1               Albania     1     3  1816   561
2               Algeria    80   491  2867  4752
3        American Samoa     0     2     0     0
4               Andorra     0     3     0     0
5                Angola     1     8    70    61
6   Antigua and Barbuda     0    31    13    27
7             Argentina   368   678   427   459
8               Armenia     0     0   124   252
9             Australia   702   620   599   933
10              Austria   234   158    97   124

## manipulating data

In [34]:
d2['english'] +d2['math'] + d2['science']

0    201
1    246
2    257
3    235
dtype: int64

In [35]:
d2['total'] = d2['english'] + d2['math'] + d2['science']
d2

     name  english  math  science  total
0   arjun       45    67       89    201
1  jyothi       67    89       90    246
2     sai       89    90       78    257
3     sri       90    78       67    235

In [37]:
d2['average']= d2['english']+d2['math']+d2['science']